shehzad001/eos/cpe484_es6153/Micrium/Software/EvalBoards/TI/LM3S9B92-EVALBOT/IAR/uCOS-III-CE4053_PG/app.c
/*
*********************************************************************************************************
*                                          STARTUP TASK
*
* Description : This is an example of a startup task.  As mentioned in the book's text, you MUST
*               initialize the ticker only once multitasking has started.
*
* Arguments   : p_arg   is the argument passed to 'AppTaskStart()' by 'OSTaskCreate()'.
*
* Returns     : none
*
* Notes       : 1) The first line of code is used to prevent a compiler warning because 'p_arg' is not
*                  used.  The compiler should not generate any code for this statement.
*********************************************************************************************************
*/

static  void  AppTaskStart (void  *p_arg)
{
    CPU_INT32U  clk_freq;
    CPU_INT32U  ulPHYMR0;
    CPU_INT32U  cnts;
    OS_ERR      err;
    
    OS_TCB *AppTaskArray_Mutex2[]= {(OS_TCB*)&AppTaskOneTCB,(OS_TCB*) &AppTaskTwoTCB,(OS_TCB*) &AppTaskThreeTCB};
    OS_TCB *AppTaskArray_Mutex3[] = {&AppTaskOneTCB, &AppTaskTwoTCB, &AppTaskThreeTCB};

   (void)&p_arg;

    BSP_Init();                                                 /* Initialize BSP functions                             */
    CPU_Init();                                                 /* Initialize the uC/CPU services                       */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_ETH);                  /* Enable and Reset the Ethernet Controller.            */
    SysCtlPeripheralReset(SYSCTL_PERIPH_ETH);
    ulPHYMR0 = EthernetPHYRead(ETH_BASE, PHY_MR0);              /* Power Down PHY                                       */
    EthernetPHYWrite(ETH_BASE, PHY_MR0, ulPHYMR0 | PHY_MR0_PWRDN);
    SysCtlPeripheralDeepSleepDisable(SYSCTL_PERIPH_ETH);
    clk_freq = BSP_CPUClkFreq();                                /* Determine SysTick reference freq.                    */
    cnts     = clk_freq / (CPU_INT32U)OSCfg_TickRate_Hz;        /* Determine nbr SysTick increments                     */
    OS_CPU_SysTickInit(cnts);                                   /* Init uC/OS periodic time src (SysTick).              */
    CPU_TS_TmrFreqSet(clk_freq);
    
    #if(MICROSD_EN == 1)
    /* Mount the file system, using logical disk 0 */
    f_mount(0, &g_sFatFs);
    /* Create a new log.txt file */
    CmdLineProcess(g_cCmdBuf);
    #endif

    /* Enable Wheel ISR Interrupt */
    AppRobotMotorDriveSensorEnable();
    
    /* Create Dummy Queue */
    OSQCreate((OS_Q *)&DummyQ, (CPU_CHAR *)"Dummy Queue", (OS_MSG_QTY)5, (OS_ERR *)&err);
    

    /* Initialise the 3 Main Tasks to  Deleted State */
    OSTaskCreate((OS_TCB    *)&AppTaskOneTCB,
                (CPU_CHAR   *)"App Task One", 
                (OS_TASK_PTR ) AppTaskOne, 
                (void       *) 0, 
                (OS_PRIO     ) APP_TASK_ONE_PRIO, 
                (CPU_STK    *)&AppTaskOneStk[0], 
                (CPU_STK_SIZE) APP_TASK_ONE_STK_SIZE / 10u, 
                (CPU_STK_SIZE) APP_TASK_ONE_STK_SIZE, 
                (OS_MSG_QTY  ) 0u, 
                (OS_TICK     ) 0u, 
                (void       *)(CPU_INT32U) 1, 
                (OS_OPT      )(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR | OS_OPT_EDF_LIST), 
                (OS_TICK     ) (TASK1PERIOD * 1000), 
                (OS_ERR     *)&err);
    OSTaskDel((OS_TCB *)&AppTaskOneTCB, &err);

    OSTaskCreate((OS_TCB     *)&AppTaskTwoTCB, 
                 (CPU_CHAR   *)"App Task Two", 
                 (OS_TASK_PTR ) AppTaskTwo, 
                 (void       *) 0, 
                 (OS_PRIO     ) APP_TASK_TWO_PRIO, 
                 (CPU_STK    *)&AppTaskTwoStk[0], 
                 (CPU_STK_SIZE) APP_TASK_TWO_STK_SIZE / 10u, 
                 (CPU_STK_SIZE) APP_TASK_TWO_STK_SIZE, 
                 (OS_MSG_QTY  ) 0u, 
                 (OS_TICK     ) 0u, 
                 (void       *) (CPU_INT32U) 2, 
                 (OS_OPT      )(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR | OS_OPT_EDF_LIST), 
                 (OS_TICK     ) (TASK2PERIOD * 1000), 
                 (OS_ERR     *)&err);
    OSTaskDel((OS_TCB *)&AppTaskTwoTCB, &err);

    OSTaskCreate((OS_TCB     *)&AppTaskThreeTCB, 
                 (CPU_CHAR   *)"App Task Three", 
                 (OS_TASK_PTR ) AppTaskThree, 
                 (void       *) 0, 
                 (OS_PRIO     ) APP_TASK_THREE_PRIO, 
                 (CPU_STK    *)&AppTaskThreeStk[0], 
                 (CPU_STK_SIZE) APP_TASK_THREE_STK_SIZE / 10u, 
                 (CPU_STK_SIZE) APP_TASK_THREE_STK_SIZE, 
                 (OS_MSG_QTY  ) 0u, 
                 (OS_TICK     ) 0u, 
                 (void       *) (CPU_INT32U) 3, 
                 (OS_OPT      )(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR | OS_OPT_EDF_LIST), 
                 (OS_TICK     ) (TASK3PERIOD * 1000), 
                 (OS_ERR     *)&err);
    OSTaskDel((OS_TCB *)&AppTaskThreeTCB, &err);

    /* Start!! */
    BSP_DisplayStringDraw("Go",0u, 1u);
    
    /* Tasks that recreate the 3 main tasks */
    OSTaskCreate((OS_TCB    *)&AppTaskRepeatOneTCB, (CPU_CHAR   *)"Repeat Task One", (OS_TASK_PTR ) AppTaskRepeatOne, (void       *) 0, (OS_PRIO     ) APP_TASK_REPEAT_ONE_PRIO, (CPU_STK    *)&AppTaskRepeatOneStk[0], (CPU_STK_SIZE) APP_TASK_ONE_STK_SIZE / 10u, (CPU_STK_SIZE) APP_TASK_ONE_STK_SIZE, (OS_MSG_QTY  ) 0u, (OS_TICK     ) 0u, (void       *) (CPU_INT32U) 1, (OS_OPT      )(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR), (OS_TICK     ) 0u, (OS_ERR     *)&err);
    OSTaskCreate((OS_TCB    *)&AppTaskRepeatTwoTCB, (CPU_CHAR   *)"Repeat Task Two", (OS_TASK_PTR ) AppTaskRepeatTwo, (void       *) 0, (OS_PRIO     ) APP_TASK_REPEAT_TWO_PRIO, (CPU_STK    *)&AppTaskRepeatTwoStk[0], (CPU_STK_SIZE) APP_TASK_ONE_STK_SIZE / 10u, (CPU_STK_SIZE) APP_TASK_ONE_STK_SIZE, (OS_MSG_QTY  ) 0u, (OS_TICK     ) 0u, (void       *) (CPU_INT32U) 2, (OS_OPT      )(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR), (OS_TICK     ) 0u, (OS_ERR     *)&err);
    OSTaskCreate((OS_TCB    *)&AppTaskRepeatThreeTCB, (CPU_CHAR   *)"Repeat Task Three", (OS_TASK_PTR ) AppTaskRepeatThree, (void       *) 0, (OS_PRIO     ) APP_TASK_REPEAT_THREE_PRIO, (CPU_STK    *)&AppTaskRepeatThreeStk[0], (CPU_STK_SIZE) APP_TASK_ONE_STK_SIZE / 10u, (CPU_STK_SIZE) APP_TASK_ONE_STK_SIZE, (OS_MSG_QTY  ) 0u, (OS_TICK     ) 0u, (void       *) (CPU_INT32U) 3, (OS_OPT      )(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR), (OS_TICK     ) 0u, (OS_ERR     *)&err);
     
    /* Create Mutexes */
    OSMutexCreate((OS_MUTEX *)&MutexOne,
                  (CPU_CHAR *)2,
                  0u,
                  (OS_ERR   *)&err);
    OSMutexCreate((OS_MUTEX *)&MutexTwo, 
                  (CPU_CHAR *)3, 
                  (AppTaskArray_Mutex2),
                  (OS_ERR   *)&err);
    OSMutexCreate((OS_MUTEX *)&MutexThree, 
                  (CPU_CHAR *)3, 
                  (AppTaskArray_Mutex3),
                  (OS_ERR   *)&err);
    
    /* Delete this task */
    OSTaskDel((OS_TCB *)0, &err);
}


