shehzad001/eos/cpe484_es6153/Micrium/Software/EvalBoards/TI/LM3S9B92-EVALBOT/IAR/uCOS-III-CE4053_PG/app.c
static  void  AppTaskRepeatOne (void  *p_arg)
{
    OS_ERR      err;
    OS_MSG_SIZE msg_size;
    CPU_TS ts;
    
   (void)&p_arg;
   CPU_INT32U i=0;
   
   
      while (DEF_ON)
      {
        i++;
        if(AppTaskOneTCB.TaskState == OS_TASK_STATE_DEL)
        {
          //BSP_DisplayStringDraw("C1",0u, 0u);
          OSTaskCreate((OS_TCB     *)&AppTaskOneTCB, 
                       (CPU_CHAR   *)"App Task One", 
                       (OS_TASK_PTR ) AppTaskOne, 
                       (void       *) 0, 
                       (OS_PRIO     ) APP_TASK_ONE_PRIO, 
                       (CPU_STK    *)&AppTaskOneStk[0], 
                       (CPU_STK_SIZE) APP_TASK_ONE_STK_SIZE / 10u, 
                       (CPU_STK_SIZE) APP_TASK_ONE_STK_SIZE, 
                       (OS_MSG_QTY  ) 0u, 
                       (OS_TICK     ) 0u, 
                       (void       *) (CPU_INT32U) (TASK1PERIOD*i), 
                       (OS_OPT      )(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR | OS_OPT_EDF_LIST), 
                       (OS_TICK     ) (TASK1PERIOD * 1000), 
                       (OS_ERR     *)&err);

          //  measure=OS_TS_GET();
          OSQPend(&DummyQ, (TASK1PERIOD * 1000), OS_OPT_PEND_BLOCKING, &msg_size, &ts, &err);


        }
        else
        {
          BSP_DisplayStringDraw("E1",0u, 0u);
          while (DEF_ON)
          {
            i++;
          }
          //OSQPend(&DummyQ, 300000, OS_OPT_PEND_BLOCKING, &msg_size, &ts, &err);
         
          //printf("\nE1");
        }
      }
}

static  void  AppTaskRepeatTwo (void  *p_arg)
{
      OS_ERR      err;
      OS_MSG_SIZE msg_size;
      CPU_TS ts;
      (void)&p_arg;
      CPU_INT32U i=0;
      while (DEF_ON)
      {
        i++;
        if(AppTaskTwoTCB.TaskState == OS_TASK_STATE_DEL)
        {
          //BSP_DisplayStringDraw("C2",0u, 0u);
          OSTaskCreate((OS_TCB     *)&AppTaskTwoTCB, 
                       (CPU_CHAR   *)"App Task Two", 
                       (OS_TASK_PTR ) AppTaskTwo, 
                       (void       *) 0, 
                       (OS_PRIO     ) APP_TASK_TWO_PRIO, 
                       (CPU_STK    *)&AppTaskTwoStk[0], 
                       (CPU_STK_SIZE) APP_TASK_TWO_STK_SIZE / 10u, 
                       (CPU_STK_SIZE) APP_TASK_TWO_STK_SIZE, 
                       (OS_MSG_QTY  ) 0u, 
                       (OS_TICK     ) 0u, 
                       (void       *) (CPU_INT32U) (TASK2PERIOD*i), 
                       (OS_OPT      )(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR | OS_OPT_EDF_LIST), 
                       (OS_TICK     ) (TASK2PERIOD * 1000), 
                       (OS_ERR     *)&err);

          OSQPend(&DummyQ, (TASK2PERIOD * 1000), OS_OPT_PEND_BLOCKING, &msg_size, &ts, &err);
        }
        else
        {
          BSP_DisplayStringDraw("E2",0u, 0u);
           while (DEF_ON)
          {
            i++;
          }
          //OSQPend(&DummyQ, 300000, OS_OPT_PEND_BLOCKING, &msg_size, &ts, &err);
          //printf("\nE2");
        }
      }
}

static  void  AppTaskRepeatThree (void  *p_arg)
{
    OS_ERR      err;
    OS_MSG_SIZE msg_size;
    CPU_TS ts;
   (void)&p_arg;
   CPU_INT32U i=0;

      while (DEF_ON)
      {
        i++;
        if(AppTaskThreeTCB.TaskState == OS_TASK_STATE_DEL)
        {
          //BSP_DisplayStringDraw("C3",0u, 0u);
          OSTaskCreate((OS_TCB     *)&AppTaskThreeTCB, 
                       (CPU_CHAR   *)"App Task Three", 
                       (OS_TASK_PTR ) AppTaskThree, 
                       (void       *) 0, 
                       (OS_PRIO     ) APP_TASK_THREE_PRIO, 
                       (CPU_STK    *)&AppTaskThreeStk[0], 
                       (CPU_STK_SIZE) APP_TASK_THREE_STK_SIZE / 10u, 
                       (CPU_STK_SIZE) APP_TASK_THREE_STK_SIZE, 
                       (OS_MSG_QTY  ) 0u, 
                       (OS_TICK     ) 0u, 
                       (void       *) (CPU_INT32U) (TASK3PERIOD*i), 
                       (OS_OPT      )(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR | OS_OPT_EDF_LIST), 
                       (OS_TICK     ) (TASK3PERIOD * 1000), 
                       (OS_ERR     *)&err);

          OSQPend(&DummyQ, (TASK3PERIOD * 1000), OS_OPT_PEND_BLOCKING, &msg_size, &ts, &err);
        }
        else
        {
           BSP_DisplayStringDraw("E3",0u, 0u);
           while (DEF_ON)
           {
             i++;
           }
        //  OSQPend(&DummyQ, 300000, OS_OPT_PEND_BLOCKING, &msg_size, &ts, &err);
         
          //printf("\nE3");
        }
      }
}

static  void  AppTaskOne (void  *p_arg)
{
    measure=OS_TS_GET();
    OS_ERR      err;
    CPU_INT32U  iSec, k, i, j;
    CPU_TS ts;
   
    iSec = WORKLOAD1;
    
    OSMutexPend((OS_MUTEX *)&MutexThree, (OS_TICK )0, (OS_OPT )OS_OPT_PEND_BLOCKING, (CPU_TS *)&ts, (OS_ERR *)&err);
    
    for(k=0; k<iSec; k++)
    {
      for(i=0; i <ONESECONDTICK; i++)
         j = ((i * 2) + j);
    }
    
    OSMutexPend((OS_MUTEX *)&MutexTwo, (OS_TICK )0, (OS_OPT )OS_OPT_PEND_BLOCKING, (CPU_TS *)&ts, (OS_ERR *)&err);
    if(iMove > 0)
    {
      RoboTurn(LEFT_SIDE, 14, 50);
      iMove--;
    }
    
    OSMutexPost((OS_MUTEX *)&MutexTwo, (OS_OPT )OS_OPT_POST_NONE, (OS_ERR *)&err);
    BSP_DisplayClear();
    BSP_DisplayStringDraw("TASK ONE",0u, 0u);
    OSMutexPost((OS_MUTEX *)&MutexThree, (OS_OPT )OS_OPT_POST_NONE, (OS_ERR *)&err);
     measure=OS_TS_GET()-measure;
    //printf("\nT1");
    OSTaskDel((OS_TCB *)0, &err);
}

static  void  AppTaskTwo (void  *p_arg)
{
    measure=OS_TS_GET();
    OS_ERR      err;
    CPU_INT32U  i, j=7;
    CPU_TS ts;
    
    OSMutexPend((OS_MUTEX *)&MutexThree, (OS_TICK )0, (OS_OPT )OS_OPT_PEND_BLOCKING, (CPU_TS *)&ts, (OS_ERR *)&err);
    OSMutexPend((OS_MUTEX *)&MutexTwo, (OS_TICK )0, (OS_OPT )OS_OPT_PEND_BLOCKING, (CPU_TS *)&ts, (OS_ERR *)&err);
    for(i=0; i <(WORKLOAD2*ONESECONDTICK); i++)
    {
      j = ((i * 2) + j);
    }
    
    BSP_DisplayClear();
    BSP_DisplayStringDraw("TASK TWO",0u, 0u);
    OSMutexPost((OS_MUTEX *)&MutexTwo, (OS_OPT )OS_OPT_POST_NONE, (OS_ERR *)&err);
    OSMutexPost((OS_MUTEX *)&MutexThree, (OS_OPT )OS_OPT_POST_NONE, (OS_ERR *)&err);
    
    #if(MICROSD_EN == 1) 
    sprintf(g_cCmdBuf,"app log.txt  %d %d %d", j, iCounter++, (OSTimeGet(&err)/100));
    CmdLineProcess(g_cCmdBuf);
    #endif
    measure=OS_TS_GET()-measure;
    //printf("\nT2");
    OSTaskDel((OS_TCB *)0, &err);
}

